gneidermeier/stm8_mcp/src/main.c
/**
  ******************************************************************************
  * @file main.c
  * @brief This file contains the main function for the BLDC motor control
  * @author Neidermeier
  * @version
  * @date March-2020
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "stm8s.h"
#include "parameter.h" // app defines


/* Private defines -----------------------------------------------------------*/

#define UARTputs  uart_print // tmp this is sometimes a coding std no-no


#define ADC_N_CHANNELS 10       // [A0:A9]


/* Public variables  ---------------------------------------------------------*/

uint8_t TaskRdy;           // flag for timer interrupt for BG task timing

uint8_t Log_Level;


/* Private variables ---------------------------------------------------------*/

//static


/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/*
 * home-made itoa function (16-bits only, hex-only)
 * seems Cosmic only provide atoi in stdlib and not itoa
 */
char * itoa(uint16_t u16in, char *sbuf, int base)
{
    int x;
    int shift = 16 - 4;	/* 4-bits to 1 nibble */
    uint16_t n16 = u16in;

    if (16 != base)
    {
        return NULL;
    }

    x = 0;
    while (x < 4 /* 4 nibbles in 16-bit word */ )
    {
        unsigned char c = (n16 >> shift) & 0x000F;

        if (c > 9)
        {
            c -= 10;
            c += 'A';
        }
        else
        {
            c += '0';
        }
        sbuf[x++] = c;
        shift -= 4;
    }
    sbuf[x] = 0;

    return sbuf;
}

/*
 * some of this bulk could be reduced with macros
 * or otherwise would be suitable for STM8 Peripheral Library.
 * Noting the situation regarding unused IO pins ... I am trying to assert the 
 * configuration on the few pins needed as GPIO (general purpose IO and noting 
 * that the specific module initialization (A/D, TIMx - and these are done
 * mostly with STM8 PL) will handle setting up suitable IO pin behavior.

 * 11.4 Reset configuration
 *  All I/O pins are generally input floating under reset (i.e. during the reset phase) and at reset
 *  state (i.e. after reset release). However, a few pins may have a different behavior. Refer to
 *  the datasheet pinout description for all details.
 * 11.5 Unused I/O pins
 *  Unused I/O pins must not be left floating to avoid extra current consumption. They must be
 *  put into one of the following configurations:
 *  connected to VDD or VSS by external pull-up or pull-down resistor and kept as input
 *  floating (reset state), configured as input with internal pull-up/down resistor,
 *  configured as output push-pull low.
*/
void GPIO_Config(void)
{
// OUTPUTS
// built-in LED
    GPIOD->ODR |= (1 << LED); //LED initial state is OFF (cathode driven to Vcc)
    GPIOD->DDR |= (1 << LED); //PD.n as output
    GPIOD->CR1 |= (1 << LED); //push pull output

// Controls the /SD pins of IR2104s on PC5, PC7, PG1
///////////  // tried E2, E0, D1 but E2 not work as output ... ???
// C5, C7, and G1 are CN2 pin 6, 8, 12 so 3 leads can go in one connector shell ;)
    GPIOC->ODR &=  ~(1<<5);
    GPIOC->DDR |=  (1<<5);
    GPIOC->CR1 |=  (1<<5);

    GPIOC->ODR &=  ~(1<<7);
    GPIOC->DDR |=  (1<<7);
    GPIOC->CR1 |=  (1<<7);

    GPIOG->ODR &=  ~(1<<1);
    GPIOG->DDR |=  (1<<1);
    GPIOG->CR1 |=  (1<<1);

////////////
// use PC6 (CN2-9) and PG0 (CN2-11) as test pins
    GPIOG->ODR &= ~(1<<0);
    GPIOG->DDR |=  (1<<0);
    GPIOG->CR1 |=  (1<<0);

    GPIOC->ODR |=  (1<<6); 				//  cathode of LED on PC6
    GPIOC->DDR |=  (1<<6);
    GPIOC->CR1 |=  (1<<6);

#if 0 // these are set by TIM2 PWM API calls 
// 3 PWM Channels
// T2.PWM.CH3
    GPIOA->ODR |=  (1<<3);  // PA3
    GPIOA->DDR |=  (1<<3);
    GPIOA->CR1 |=  (1<<3);
// T2.PWM.CH2
    GPIOD->ODR |=  (1<<3);  // PD3
    GPIOD->DDR |=  (1<<3);
    GPIOD->CR1 |=  (1<<3);
// T2.PWM.CH1
    GPIOD->ODR |=  (1<<4);  // PD4
    GPIOD->DDR |=  (1<<4);
    GPIOD->CR1 |=  (1<<4);
#endif
#if 0 // TIM1 CH1, CH2, CH3, CH4
// T1.PWM.CH1
    GPIOC->ODR |=  (1<<1);  // PC1
    GPIOC->DDR |=  (1<<1);
    GPIOC->CR1 |=  (1<<1);
// T1.PWM.CH2
    GPIOC->ODR |=  (1<<2);  // PC2
    GPIOC->DDR |=  (1<<2);
    GPIOC->CR1 |=  (1<<2);
// T1.PWM.CH3
    GPIOC->ODR |=  (1<<3);  // PC3
    GPIOC->DDR |=  (1<<3);
    GPIOC->CR1 |=  (1<<3);
// T1.PWM.CH4
    GPIOC->ODR |=  (1<<4);  // PC4
    GPIOC->DDR |=  (1<<4);
    GPIOC->CR1 |=  (1<<4);
#endif

// INPUTS
// PA4 as button input (Stop)
    GPIOA->DDR &= ~(1 << 4); // PA.4 as input
    GPIOA->CR1 |= (1 << 4);  // pull up w/o interrupts
// uses CN2.7 as GND

// PA6 as button input (B+)
    GPIOA->DDR &= ~(1 << 6); // PA.6 as input
    GPIOA->CR1 |= (1 << 6);  // pull up w/o interrupts
#if 0
    GPIOA->DDR |= (1 << 5);  // PA.5 as OUTPUT
    GPIOA->CR1 |= (1 << 5);  // push pull output
    GPIOA->ODR &= ~(1 << 5); // set pin off to use as gnd of button
#endif
// PE5 as button input (B-)
    GPIOE->DDR &= ~(1 << 5); // PE.5 as input
    GPIOE->CR1 |= (1 << 5);  // pull up w/o interrupts
#if 0
    GPIOE->DDR |= (1 << 3);  // PE.3 as OUTPUT
    GPIOE->CR1 |= (1 << 3);  // push pull output
    GPIOE->ODR &= ~(1 << 3); // set pin off to use as gnd of button
#endif
#if 0 // UartX_Init()
// UART2 D5: Rx, D6: Tx
    GPIOD->DDR &= ~(1 << 5); // PD.5 as input
    GPIOD->CR1 |= (1 << 5);  // pull up w/o interrupts
    GPIOD->DDR |= (1 << 6);  // PD.6 as output
    GPIOD->CR1 |= (1 << 6);  // push pull output
    GPIOD->ODR |= (1 << 6);  // use as hi-side of button
#endif

// PE.6 AIN9
    GPIOE->DDR &= ~(1 << 6);  // PE.6 as input
    GPIOE->CR1 &= ~(1 << 6);  // floating input
    GPIOE->CR2 &= ~(1 << 6);  // 0: External interrupt disabled   ???

// PE.7 AIN8
    GPIOE->DDR &= ~(1 << 7);  // PE.7 as input
    GPIOE->CR1 &= ~(1 << 7);  // floating input
    GPIOE->CR2 &= ~(1 << 7);  // 0: External interrupt disabled   ???

// AIN7
    GPIOB->DDR &= ~(1 << 7);  // PB.7 as input
    GPIOB->CR1 &= ~(1 << 7);  // floating input
    GPIOB->CR2 &= ~(1 << 7);  // 0: External interrupt disabled   ???

// AIN6
    GPIOB->DDR &= ~(1 << 6);  // PB.6 as input
    GPIOB->CR1 &= ~(1 << 6);  // floating input
    GPIOB->CR2 &= ~(1 << 6);  // 0: External interrupt disabled   ???

// AIN5
    GPIOB->DDR &= ~(1 << 5);  // PB.5 as input
    GPIOB->CR1 &= ~(1 << 5);  // floating input
    GPIOB->CR2 &= ~(1 << 5);  // 0: External interrupt disabled   ???

// AIN4
    GPIOB->DDR &= ~(1 << 4);  // PB.4 as input
    GPIOB->CR1 &= ~(1 << 4);  // floating input
    GPIOB->CR2 &= ~(1 << 4);  // 0: External interrupt disabled   ???

// AIN3
    GPIOB->DDR &= ~(1 << 3);  // PB.3 as input
    GPIOB->CR1 &= ~(1 << 3);  // floating input
    GPIOB->CR2 &= ~(1 << 3);  // 0: External interrupt disabled   ???

