gneidermeier/stm8_mcp/src/main.c
// AIN2
    GPIOB->DDR &= ~(1 << 2);  // PB.2 as input
    GPIOB->CR1 &= ~(1 << 2);  // floating input
    GPIOB->CR2 &= ~(1 << 2);  // 0: External interrupt disabled   ???

// AIN1
    GPIOB->DDR &= ~(1 << 1);  // PB.1 as input
    GPIOB->CR1 &= ~(1 << 1);  // floating input
    GPIOB->CR2 &= ~(1 << 1);  // 0: External interrupt disabled   ???

// AIN0
    GPIOB->DDR &= ~(1 << 0);  // PB.0 as input
    GPIOB->CR1 &= ~(1 << 0);  // floating input
    GPIOB->CR2 &= ~(1 << 0);  // 0: External interrupt disabled   ???
}

/*
 * http://embedded-lab.com/blog/starting-stm8-microcontrollers/24/
 */
void UART_setup(void)
{
    UART2_DeInit();

    UART2_Init(115200,
               UART2_WORDLENGTH_8D,
               UART2_STOPBITS_1,
               UART2_PARITY_NO,
               UART2_SYNCMODE_CLOCK_DISABLE,
               UART2_MODE_TXRX_ENABLE);

    UART2_Cmd(ENABLE);
}

/*
*  Send a message to the debug port (UART1).
*    (https://blog.mark-stevens.co.uk/2012/08/using-the-uart-on-the-stm8s-2/)
*/
void uart_print(char *message)
{
    char *ch = message;
    while (*ch)
    {
        UART2->DR = (unsigned char) *ch;     //  Put the next character into the data transmission register.
        while ( 0 == (UART2->SR & UART2_SR_TXE) ); //  Wait for transmission to complete.
        ch++;                               //  Grab the next character.
    }
}

/*
 * https://www.st.com/resource/en/application_note/cd00282842-rs232-communications-with-a-terminal-using-the-stm8sdiscovery-stmicroelectronics.pdf
 */
/*******************************************************************************
* Function Name  : SerialKeyPressed
* Description    : Test to see if a key has been pressed on the HyperTerminal
* Input          : - key: The key pressed
* Output         : None
* Return         : 1: Correct
*                  0: Error
*******************************************************************************/
u8 SerialKeyPressed(char *key)
{
    FlagStatus flag  ;
    /* First clear Rx buffer */
    flag = UART2_GetFlagStatus(UART2_FLAG_RXNE);
    if ( flag == SET)
    {
        *key = (char)UART2->DR;
        return 1;
    }
    else
    {
        return 0;
    }
}

/*******************************************************************************
* Function Name  : GetKey
* Description    : Get a key from the HyperTerminal
* Input          : None
* Output         : None
* Return         : The Key Pressed
*******************************************************************************/
char GetKey(void)
{
    char key = 0;
    /* Waiting for user input */
    while (1)
    {
        if (SerialKeyPressed((char*)&key)) break;
    }
    return key;
}

/*
 * ADC clock must be between 1 MHz and 4 or 6 MHz ... use D4 here (good for 4 - 16 Mhz cpu clock @ D4)
 */
#ifdef CLOCK_16
// #define ADC_DIVIDER ADC1_PRESSEL_FCPU_D16
#else
// #define ADC_DIVIDER ADC1_PRESSEL_FCPU_D8  // 1 Mhz, min sample rate
// #define ADC_DIVIDER ADC1_PRESSEL_FCPU_D2  // maybe theres no reason to change it
 #define ADC_DIVIDER ADC1_PRESSEL_FCPU_D4  // 4 ->  8/4=2 and 16/4=4 which are both in the req'd range of 1-4Mhz
#endif
/*
 * https://community.st.com/s/question/0D50X00009XkbA1SAJ/multichannel-adc
 */
void ADC1_setup(void)
{
// Port B[0..7]=floating input no interr
// STM8 Discovery, all PortB pins are on CN3
//    GPIO_Init(GPIOB, GPIO_PIN_ALL, GPIO_MODE_IN_FL_NO_IT); // all AIN pins setup explicityly with the GPIO init

    ADC1_DeInit();

// configured range of A/D input pins: CH0, CH1, CH2 to use as b-EMF sensors
    ADC1_Init(ADC1_CONVERSIONMODE_SINGLE,
              ADC1_CHANNEL_2,
              ADC_DIVIDER,
              ADC1_EXTTRIG_TIM,      //  ADC1_EXTTRIG_GPIO
              DISABLE,               // ExtTriggerState
              ADC1_ALIGN_RIGHT,
              ADC1_SCHMITTTRIG_ALL,
              DISABLE);              // SchmittTriggerState

#ifdef ADC_EOCIE // interrupted ADC messes w/ motor
    ADC1_ITConfig(ADC1_IT_EOCIE, ENABLE);
#endif

    /*
    A single conversion is performed for each channel starting with AIN0 and the data is stored
    in the data buffer registers ADC_DBxR.
    */
    ADC1_ConversionConfig(ADC1_CONVERSIONMODE_CONTINUOUS,
                          ((ADC1_Channel_TypeDef)(ADC1_CHANNEL_0 | ADC1_CHANNEL_1 | ADC1_CHANNEL_2)),
                          ADC1_ALIGN_RIGHT);

//ADC1_DataBufferCmd(ENABLE);
    ADC1_ScanModeCmd(ENABLE); // Scan mode from channel 0 to 9 (as defined in ADC1_Init)

// Enable the ADC: 1 -> ADON for the first time it just wakes the ADC up
    ADC1_Cmd(ENABLE);

// ADON = 1 for the 2nd time => starts the ADC conversion of all channels in sequence
    ADC1_StartConversion();
}

/*
 * Timer 1 Setup
 * from:
 *   http://www.emcu.it/STM8/STM8-Discovery/Tim1eTim4/TIM1eTIM4.html
 *
 * manual mode (ramp-up) commutation timing?
 * based on OTS ESC analysic, rampup start at
 *  pd = 0.008  sec
 *       0.003  sec  rampup to 3000 RPM
 *       0.004  sec  settle to 2500 RPM
 *       0.008  sec  1250 RPM slowest attainable after initial sync
 *
 *       0.0012 sec
*/
#ifdef CLOCK_16
#define TIM1_PRESCALER 8  //    (1/16Mhz) * 8 * 250 -> 0.000125 S
#else
#define TIM1_PRESCALER 4  //    (1/8Mhz)  * 4 * 250 -> 0.000125 S
#endif

#define PWM_MODE  TIM1_OCMODE_PWM1

void TIM1_setup(void)
{
    const uint16_t T1_Period = TIM2_PWM_PD /* TIMx_PWM_PD */ ;  // 16-bit counter  ... 260 test

    CLK_PeripheralClockConfig (CLK_PERIPHERAL_TIMER1, ENABLE);  // put this with clocks setup

    TIM1_DeInit();

    TIM1_TimeBaseInit(( TIM1_PRESCALER - 1 ), TIM1_COUNTERMODE_UP, T1_Period, 0); // ISR at and of "idle" time

    /* Channel 2 PWM configuration */
    TIM1_OC2Init( PWM_MODE,
                  TIM1_OUTPUTSTATE_ENABLE,
                  TIM1_OUTPUTNSTATE_ENABLE,
                  0,
                  TIM1_OCPOLARITY_HIGH,
                  TIM1_OCNPOLARITY_HIGH,
                  TIM1_OCIDLESTATE_RESET,
                  TIM1_OCNIDLESTATE_RESET);
    //   TIM2_OC2PreloadConfig(ENABLE); ??

