gneidermeier/stm8_mcp/src/main.c
    /* Channel 3 PWM configuration */
    TIM1_OC3Init( PWM_MODE,
                  TIM1_OUTPUTSTATE_ENABLE,
                  TIM1_OUTPUTNSTATE_ENABLE,
                  0,
                  TIM1_OCPOLARITY_HIGH,
                  TIM1_OCNPOLARITY_HIGH,
                  TIM1_OCIDLESTATE_RESET,
                  TIM1_OCNIDLESTATE_RESET);
// ?  TIM2_OC3PreloadConfig(ENABLE);

    /* Channel 4 PWM configuration */
    TIM1_OC4Init(PWM_MODE,
                 TIM1_OUTPUTSTATE_ENABLE,
                 0,
                 TIM1_OCPOLARITY_HIGH,
                 TIM1_OCIDLESTATE_RESET);
// TIM2_OC4PreloadConfig(ENABLE); // ???

    TIM1_CtrlPWMOutputs(ENABLE);

    TIM1_ITConfig(TIM1_IT_UPDATE, ENABLE);
    TIM1_Cmd(ENABLE);
}

/*
 * 9/30 .. verbatim from code of AN3332
 */
#define CCR1_Val  ((u16)0 /* 500 */) // Configure channel 1 Pulse Width
#define CCR2_Val  ((u16)0 /* 250 */) // Configure channel 2 Pulse Width
#define CCR3_Val  ((u16)0 /* 750 */) // Configure channel 3 Pulse Width

#ifdef CLOCK_16
 #define TIM2_PRESCALER TIM2_PRESCALER_8  //    (1/16Mhz) * 8 * 250 -> 0.000125 S
#else
 #define TIM2_PRESCALER TIM2_PRESCALER_4  //    (1/8Mhz)  * 4 * 250 -> 0.000125 S
#endif


void TIM2_setup(void)
{
    /* TIM2 Peripheral Configuration */
    TIM2_DeInit();

    /* Set TIM2 Frequency to 2Mhz */
    TIM2_TimeBaseInit(TIM2_PRESCALER, TIM2_PWM_PD);
    /* Channel 1 PWM configuration */
    TIM2_OC1Init(TIM2_OCMODE_PWM2, TIM2_OUTPUTSTATE_ENABLE, CCR1_Val, TIM2_OCPOLARITY_LOW );
    TIM2_OC1PreloadConfig(ENABLE);

    /* Channel 2 PWM configuration */
    TIM2_OC2Init(TIM2_OCMODE_PWM2, TIM2_OUTPUTSTATE_ENABLE, CCR2_Val, TIM2_OCPOLARITY_LOW );
    TIM2_OC2PreloadConfig(ENABLE);

    /* Channel 3 PWM configuration */
    TIM2_OC3Init(TIM2_OCMODE_PWM2, TIM2_OUTPUTSTATE_ENABLE, CCR3_Val, TIM2_OCPOLARITY_LOW );
    TIM2_OC3PreloadConfig(ENABLE);

    /* Enables TIM2 peripheral Preload register on ARR */
    TIM2_ARRPreloadConfig(ENABLE);


    TIM2_ITConfig(TIM2_IT_UPDATE, ENABLE); // GN: for eventual A/D triggering

    /* Enable TIM2 */
    TIM2_Cmd(ENABLE);
}


/*
 * Configure Timer 4 as general purpose fixed time-base reference
 * Timer 4 & 6 are 8-bit basic timers
 *
 *   https://lujji.github.io/blog/bare-metal-programming-stm8/
 *
 * Setting periodic task for fast-ish rate of A/D acquisition.
 * ISR must set 'TaskRdy' flag and not block on the task since A/D does a blocking wait.
 */
void TIM4_setup(void)
{
//    const uint8_t T4_Period = 32;     // Period =  256uS ... stable, any faster becomes jittery
//    const uint8_t T4_Period = 255;    // Period = 2.048mS
// set this for ~1mS to use in place of TIM1 as ramp timer
//const uint8_t T4_Period = 128;    // Period = 1.02mS
    const uint8_t T4_Period = 64;    // Period =  0.000512 S  (512 uS) ... 

#ifdef CLOCK_16
    TIM4->PSCR = 0x07; // PS = 128  -> 0.0000000625 * 128 * p
#else
    TIM4->PSCR = 0x06; // PS =  64  -> 0.000000125  *  64 * p
#endif

    TIM4->ARR = T4_Period;

    TIM4->IER |= TIM4_IER_UIE; // Enable Update Interrupt
    TIM4->CR1 |= TIM4_CR1_CEN; // Enable TIM4
}

/*
 * Timers 2 3 & 5 are 16-bit general purpose timers
 *  Sets the commutation switching period.
 *
 *  @8Mhz, fMASTER period ==  0.000000125 S
 *   Timer Step:
 *     step = 1 / 8Mhz * prescaler = 0.000000125 * (2^1) = 0.000000250 S
 */
#ifdef CLOCK_16
#define TIM3_PSCR  0x02  // 2^2 == 4
#else
#define TIM3_PSCR  0x01  // 2^1 == 2
#endif

void TIM3_setup(uint16_t period)
{
    TIM3->PSCR = TIM3_PSCR;

    TIM3->ARRH = period >> 8;   // be sure to set byte ARRH first, see data sheet
    TIM3->ARRL = period & 0xff;

    TIM3->IER |= TIM3_IER_UIE; // Enable Update Interrupt
    TIM3->CR1 = TIM3_CR1_ARPE; // auto (re)loading the count
    TIM3->CR1 |= TIM3_CR1_CEN; // Enable TIM3
}

/*
 * http://embedded-lab.com/blog/starting-stm8-microcontrollers/13/
 * GN:  by default  microcontroller uses   internal 16MHz RC oscillator
 * ("HSI", or high-speed internal) divided by eight  as a clock source. This results in a base timer frequency of 2MHz.
 * Using this function just to show the library way to explicit clock setup.
 */
void clock_setup(void)
{
    CLK_DeInit();
#ifdef INTCLOCK
#else
    // Configure Quartz Clock
    CLK_DeInit();
    CLK_HSECmd(ENABLE);
#ifdef CLOCK_16
    CLK_SYSCLKConfig(CLK_PRESCALER_HSIDIV1); // 16Mhz
#else
    CLK_SYSCLKConfig(CLK_PRESCALER_HSIDIV2); // 8Mhz
#endif // CLK
#endif
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_SPI, DISABLE);
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_I2C, DISABLE);
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_ADC, ENABLE);
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_AWU, DISABLE);
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_UART1, ENABLE);
    CLK_PeripheralClockConfig (CLK_PERIPHERAL_TIMER1, ENABLE);
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER2, ENABLE);
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER4, ENABLE);
}


// hack, temp

static uint16_t Line_Count = 0;

extern uint16_t BLDC_OL_comm_tm;
extern uint16_t Back_EMF_R[];
extern uint16_t Back_EMF_F[];
extern uint16_t Back_EMF_F0_MA;
extern uint16_t Back_EMF_R0_MA;

extern uint16_t Back_EMF_F_tmp;
extern uint16_t Back_EMF_F0_MA_tmp;
extern uint16_t Back_EMF_R_tmp;
extern uint16_t Back_EMF_R0_MA_tmp;
/*
 * temp, todo better function
 */
void testUART(void)
{
    char sbuf[128] ;                     // am i big enuff?
    char cbuf[8] = { 0, 0 };

    sbuf[0] = 0;

    Line_Count  += 1;;

    strcat(sbuf, "(");
    itoa(Line_Count, cbuf, 16);
    strcat(sbuf, cbuf);
    strcat(sbuf, ")");

    strcat(sbuf, " CT=");
    itoa(BLDC_OL_comm_tm, cbuf, 16);
    strcat(sbuf, cbuf);

#if 1
// tmep ... log the test back-EMF falling-float transition
    strcat(sbuf, " bF0_ma=");
    itoa( Back_EMF_F0_MA_tmp,     cbuf, 16);
    strcat(sbuf, cbuf);

    strcat(sbuf, " bF0=");
    itoa( Back_EMF_F_tmp,     cbuf, 16);
    strcat(sbuf, cbuf);
#endif
#if 1
// tmep ... log the test back-EMF falling-float transition
    strcat(sbuf, " bR0_ma=");
    itoa( Back_EMF_R0_MA_tmp,     cbuf, 16);
    strcat(sbuf, cbuf);

    strcat(sbuf, " bR0=");
    itoa( Back_EMF_R_tmp,     cbuf, 16);
    strcat(sbuf, cbuf);
#endif
#if 0
    strcat(sbuf, " A0=");
    itoa(ADC1_GetBufferValue(0), cbuf, 16);
    strcat(sbuf, cbuf);

    strcat(sbuf, " A1=");
    itoa(ADC1_GetBufferValue(1), cbuf, 16);
    strcat(sbuf, cbuf);

    strcat(sbuf, " A2=");
    itoa(ADC1_GetBufferValue(2), cbuf, 16);
    strcat(sbuf, cbuf);
#endif
#if 0
    strcat(sbuf, " A8=");
    itoa(ADC1_GetBufferValue(8), cbuf, 16);
    strcat(sbuf, cbuf);

    strcat(sbuf, " A9=");
    itoa(ADC1_GetBufferValue(9), cbuf, 16);
    strcat(sbuf, cbuf);
#endif
#if 0
// A/D
    for (loop = 0; loop <  ADC_N_CHANNELS ; loop++)
    {
        strcat(sbuf, " A");
        cbuf[0] = 0x30 + loop;
        cbuf[1] = 0;
        strcat(sbuf, cbuf);
        strcat(sbuf, "=");

//itoa(AnalogInputs[loop], cbuf, 16);
        itoa( ADC1_GetBufferValue( loop ), cbuf, 16);
        strcat(sbuf, cbuf);
    }
#endif

    strcat(sbuf, "\r\n");
    UARTputs(sbuf);
}

